DroneBridge/ESP32/main/main.c
/*
 *   This file is part of DroneBridge: https://github.com/DroneBridge/ESP32
 *
 *   Copyright 2018 Wolfgang Christl
 *
 *   Licensed under the Apache License, Version 2.0 (the "License");
 *   you may not use this file except in compliance with the License.
 *   You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 *   Unless required by applicable law or agreed to in writing, software
 *   distributed under the License is distributed on an "AS IS" BASIS,
 *   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *   See the License for the specific language governing permissions and
 *   limitations under the License.
 *
 */

/******************************************************************************
 * Header Inclusion
 ******************************************************************************/

/******************************************************************************
 * Standard C Libraries
 ******************************************************************************/
#include <stdio.h>
#include <string.h>

/******************************************************************************
 * ESP-IDF Core Libraries
 ******************************************************************************/
#include "esp_log.h"
#include "esp_mac.h"
#include "esp_event.h"
#include "esp_wifi.h"
#include "esp_wifi_types.h"
#include "nvs_flash.h"
#include "driver/gpio.h"
#include "esp_vfs_semihost.h"
#include "esp_spiffs.h"

/******************************************************************************
 * FreeRTOS
 ******************************************************************************/
#include "freertos/event_groups.h"

/******************************************************************************
 * LWIP / Network Services
 ******************************************************************************/
#include "lwip/apps/netbiosns.h"

/******************************************************************************
 * Project Headers
 ******************************************************************************/
#include "main.h"
#include "globals.h"
#include "db_parameters.h"
#include "db_serial.h"
#include "db_protocol.h"
#include "db_esp32_control.h"
#include "db_esp_now.h"
#include "http_server.h"
#include "mdns.h"
#include "iot_button.h"

#ifdef CONFIG_BT_ENABLED
#include "db_ble.h"
#endif

/******************************************************************************
 * Macros
 ******************************************************************************/
#define NVS_NAMESPACE "settings"

/* used to reset ESP to defaults and force restart or to reset the mode to
 * access point mode */
#ifdef CONFIG_IDF_TARGET_ESP32C3
#define DB_RESET_PIN GPIO_NUM_9
#elif CONFIG_IDF_TARGET_ESP32C6
#define DB_RESET_PIN GPIO_NUM_9
#elif CONFIG_IDF_TARGET_ESP32S2
#define DB_RESET_PIN GPIO_NUM_0
#elif CONFIG_IDF_TARGET_ESP32S3
#define DB_RESET_PIN GPIO_NUM_0
#elif CONFIG_IDF_TARGET_ESP32
#define DB_RESET_PIN GPIO_NUM_0
#else
#define DB_RESET_PIN GPIO_NUM_0
#endif

static const char *TAG = "DB_ESP32";

char CURRENT_CLIENT_IP[IP4ADDR_STRLEN_MAX] = "192.168.2.1";
uint8_t DB_RADIO_IS_OFF = false; // keep track if we switched Wi-Fi/BLE off
                                 // already - by default a radio is started
db_esp_signal_quality_t db_esp_signal_quality = { .air_rssi = UINT8_MAX,
                                                  .air_noise_floor = UINT8_MAX,
                                                  .gnd_rssi = UINT8_MAX,
                                                  .gnd_noise_floor =
                                                    UINT8_MAX };
wifi_sta_list_t wifi_sta_list = { .num = 0 };
uint8_t LOCAL_MAC_ADDRESS[6];
udp_conn_list_t *udp_conn_list;

// Wi-Fi client mode vars
static int s_retry_num = 0;
static EventGroupHandle_t s_wifi_event_group;
#define WIFI_CONNECTED_BIT BIT0
#define WIFI_FAIL_BIT BIT1

esp_netif_t *esp_default_netif;

/******************************************************************************
 * Private Function Declarations
 ******************************************************************************/
static esp_err_t set_dns_server(esp_netif_t *netif, uint32_t addr,
                                esp_netif_dns_type_t type);

/**
 * Assigns static IP to ESP32 when in client mode and static IP, GW and netmask
 * are set in config. Stops client DHCP server
 */
static void set_client_static_ip();

/**
 * Devices get added based on IP (check if IP & PORT are already listed) and
 * removed from the UDP broadcast connection based on MAC address
 *
 * @param arg
 * @param event_base
 * @param event_id
 * @param event_data
 */
static void wifi_event_handler(void *arg, esp_event_base_t event_base,
                               int32_t event_id, void *event_data);

static void start_mdns_service();

/**
 * Launches an access point where ground stations can connect to
 *
 * @param wifi_mode Allows to overwrite an AP mode from traditional WiFi to LR
 * Mode
 */
static void init_wifi_apmode(int wifi_mode);

/**
 * Initializes the ESP Wi-fi client/station mode where we connect to a known
 * access point.
 */
static int init_wifi_clientmode();

/**
 * Initialize Wi-Fi for ESP-NOW mode.
 * If someone uses ESP-NOW over Wi-Fi it is because he wants range over
 * everything else. LR mode makes it very inconvenient to change settings but
 * gives the most range. No AP mode since AP will not be visible.
 */
static void init_wifi_espnow();

/**
 * Read stored settings from internal storage including the saved UDP client.
 */
static void read_settings_nvs();

/**
 * Callback for a short press (<CONFIG_BUTTON_SHORT_PRESS_TIME_MS) of the
 * reset/boot button. Sets mode to WiFi access point mode with default password
 * "dronebridge" so user can check/change the config
 * @param arg
 */
static void short_press_callback(void *arg, void *usr_data);

/**
 * Callback for a long press (>CONFIG_BUTTON_LONG_PRESS_TIME_MS) of the
 * reset/boot button. Resets all settings to defaults.
 * @param arg
 */
static void long_press_callback(void *arg, void *usr_data);

/**
 * Setup boot button GPIO to reset entire ESP32 settings and to force a reboot
 * of the system
 */
static void set_reset_trigger();

/**
 * 1. Checks if RF Switch is configured.
 * 2. Enables RF switch (necessary on some boards).
 * 3. Sets RF switch according to user setting.
 * Must be called before radio/Wi-Fi gets initialized!
 */
static void configure_antenna();

