DroneBridge/ESP32/main/main.c
/******************************************************************************
 * Private Function Definitions
 ******************************************************************************/

static esp_err_t
set_dns_server(esp_netif_t *netif, uint32_t addr, esp_netif_dns_type_t type)
{
  if(addr && (addr != IPADDR_NONE)) {
    esp_netif_dns_info_t dns;
    dns.ip.u_addr.ip4.addr = addr;
    dns.ip.type = IPADDR_TYPE_V4;
    ESP_ERROR_CHECK(esp_netif_set_dns_info(netif, type, &dns));
  }
  return ESP_OK;
}

static void
set_client_static_ip()
{
  if(DB_PARAM_RADIO_MODE == DB_WIFI_MODE_STA &&
     strlen((char *)DB_PARAM_STA_IP) > 0 &&
     strlen((char *)DB_PARAM_STA_GW) > 0 &&
     strlen((char *)DB_PARAM_STA_IP_NETMASK) > 0) {
    ESP_LOGI(
      TAG,
      "Assigning static IP to ESP32: ESP32-IP: %s Gateway: %s Netmask: %s",
      (char *)DB_PARAM_STA_IP,
      (char *)DB_PARAM_STA_GW,
      (char *)DB_PARAM_STA_IP_NETMASK);

    if(esp_netif_dhcpc_stop(esp_default_netif) != ESP_OK) {
      ESP_LOGE(TAG, "Failed to stop dhcp client in order to set static IP");
      return;
    }
    esp_netif_ip_info_t ip;
    memset(&ip, 0, sizeof(esp_netif_ip_info_t));
    ip.ip.addr = ipaddr_addr((char *)DB_PARAM_STA_IP);
    ip.netmask.addr = ipaddr_addr((char *)DB_PARAM_STA_IP_NETMASK);
    ip.gw.addr = ipaddr_addr((char *)DB_PARAM_STA_GW);
    if(esp_netif_set_ip_info(esp_default_netif, &ip) != ESP_OK) {
      ESP_LOGE(TAG, "Failed to set static ip info");
    }
    ESP_LOGD(TAG,
             "Success to set static ip: %s, netmask: %s, gw: %s",
             (char *)DB_PARAM_STA_IP,
             (char *)DB_PARAM_STA_IP_NETMASK,
             (char *)DB_PARAM_STA_GW);
    ESP_ERROR_CHECK(set_dns_server(esp_default_netif,
                                   ipaddr_addr((char *)DB_PARAM_STA_GW),
                                   ESP_NETIF_DNS_MAIN));
    ESP_ERROR_CHECK(set_dns_server(
      esp_default_netif, ipaddr_addr("0.0.0.0"), ESP_NETIF_DNS_BACKUP));
  }
  else {
    // no static IP specified let the DHCP assign us one
  }
}

static void
wifi_event_handler(void *arg, esp_event_base_t event_base, int32_t event_id,
                   void *event_data)
{
  // Wifi access point mode events
  if(event_id == WIFI_EVENT_AP_STACONNECTED) {
    wifi_event_ap_staconnected_t *event =
      (wifi_event_ap_staconnected_t *)event_data;
    ESP_LOGI(TAG,
             "WIFI_EVENT - Client connected - station:" MACSTR ", AID=%d",
             MAC2STR(event->mac),
             event->aid);
    ESP_ERROR_CHECK_WITHOUT_ABORT(esp_wifi_ap_get_sta_list(
      &wifi_sta_list)); // update list of connected stations
  }
  else if(event_id == WIFI_EVENT_AP_STADISCONNECTED) {
    wifi_event_ap_stadisconnected_t *event =
      (wifi_event_ap_stadisconnected_t *)event_data;
    ESP_LOGI(TAG,
             "WIFI_EVENT - Client disconnected - station:" MACSTR ", AID=%d",
             MAC2STR(event->mac),
             event->aid);
    struct db_udp_client_t db_udp_client;
    memcpy(db_udp_client.mac, event->mac, sizeof(db_udp_client.mac));
    db_remove_from_known_udp_clients(udp_conn_list, db_udp_client);
    ESP_ERROR_CHECK_WITHOUT_ABORT(esp_wifi_ap_get_sta_list(
      &wifi_sta_list)); // update list of connected stations
  }
  else if(event_id == WIFI_EVENT_AP_START) {
    ESP_LOGI(TAG,
             "WIFI_EVENT_AP_START (SSID: %s PASS: %s)",
             DB_PARAM_WIFI_SSID,
             DB_PARAM_PASS);
  }
  else if(event_id == WIFI_EVENT_AP_STOP) {
    ESP_LOGI(TAG, "WIFI_EVENT - AP stopped!");
  }
  else if(event_base == IP_EVENT && event_id == IP_EVENT_AP_STAIPASSIGNED) {
    ip_event_ap_staipassigned_t *event =
      (ip_event_ap_staipassigned_t *)event_data;
    ESP_LOGI(TAG,
             "IP_EVENT_AP_STAIPASSIGNED - New station IP:" IPSTR,
             IP2STR(&event->ip));
    ESP_LOGI(
      TAG, "IP_EVENT_AP_STAIPASSIGNED - MAC: " MACSTR, MAC2STR(event->mac));
    struct db_udp_client_t db_udp_client;
    db_udp_client.udp_client.sin_family = PF_INET;
    db_udp_client.udp_client.sin_port = htons(APP_PORT_PROXY_UDP);
    db_udp_client.udp_client.sin_len = 16;
    db_udp_client.udp_client.sin_addr.s_addr = event->ip.addr;
    memcpy(db_udp_client.mac, event->mac, sizeof(db_udp_client.mac));
    db_add_to_known_udp_clients(udp_conn_list, db_udp_client, false);
  }
  // Wifi client mode events
  if(event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_START) {
    ESP_LOGI(TAG, "WIFI_EVENT_STA_START - Wifi Started");
    if(!DB_RADIO_IS_OFF) { // maybe the other task did set it in the meantime
      ESP_ERROR_CHECK_WITHOUT_ABORT(esp_wifi_connect());
    }
    else {
      ESP_LOGW(TAG,
               "Did not start Wi-Fi since autopilot told us he is armed "
               "(WIFI_EVENT_STA_START)");
    }
  }
  else if(event_base == WIFI_EVENT && event_id == WIFI_EVENT_STA_CONNECTED) {
    set_client_static_ip();
  }
  else if(event_base == WIFI_EVENT &&
          event_id == WIFI_EVENT_STA_DISCONNECTED) {
    ESP_LOGI(TAG,
             "WIFI_EVENT_STA_DISCONNECTED - Lost connection to access point");
    // Keep on trying
    if(!DB_RADIO_IS_OFF) {
      ESP_ERROR_CHECK_WITHOUT_ABORT(esp_wifi_connect());
      s_retry_num++;
      ESP_LOGI(TAG, "Retry to connect to the AP (%i)", s_retry_num);
    }
    else {
      ESP_LOGD(TAG,
               "WIFI_EVENT_STA_DISCONNECTED - did not try to re-connect since "
               "WiFi was commanded off");
    }
  }
  else if(event_base == IP_EVENT && event_id == IP_EVENT_STA_GOT_IP) {
    ip_event_got_ip_t *event = (ip_event_got_ip_t *)event_data;
    ESP_LOGI(TAG, "IP_EVENT_STA_GOT_IP:" IPSTR, IP2STR(&event->ip_info.ip));
    sprintf(CURRENT_CLIENT_IP, IPSTR, IP2STR(&event->ip_info.ip));
    s_retry_num = 0;
    xEventGroupSetBits(s_wifi_event_group, WIFI_CONNECTED_BIT);
  }
}

static void
start_mdns_service()
{
  esp_err_t err = mdns_init();
  if(err) {
    printf("MDNS Init failed: %d\n", err);
    return;
  }
  ESP_ERROR_CHECK(mdns_hostname_set("dronebridge"));
  ESP_ERROR_CHECK(mdns_instance_name_set("DroneBridge for ESP32"));

  ESP_ERROR_CHECK(mdns_service_add(NULL, "_http", "_tcp", 80, NULL, 0));
  ESP_ERROR_CHECK(
    mdns_service_add(NULL, "_db_proxy", "_tcp", APP_PORT_PROXY, NULL, 0));
  ESP_ERROR_CHECK(
    mdns_service_add(NULL, "_db_comm", "_tcp", APP_PORT_COMM, NULL, 0));
  ESP_ERROR_CHECK(
    mdns_service_instance_name_set("_http", "_tcp", "DroneBridge for ESP32"));
  ESP_LOGI(TAG, "MDNS Service started!");
}

#if CONFIG_WEB_DEPLOY_SEMIHOST
esp_err_t
init_fs(void)
{
  esp_err_t ret = esp_vfs_semihost_register(CONFIG_WEB_MOUNT_POINT,
                                            CONFIG_HOST_PATH_TO_MOUNT);
  if(ret != ESP_OK) {
    ESP_LOGE(
      TAG, "Failed to register semihost driver (%s)!", esp_err_to_name(ret));
    return ESP_FAIL;
  }
  return ESP_OK;
}
#endif

