DroneBridge/ESP32/main/main.c
#if CONFIG_WEB_DEPLOY_SF

esp_err_t
init_fs(void)
{
  esp_vfs_spiffs_conf_t conf = { .base_path = CONFIG_WEB_MOUNT_POINT,
                                 .partition_label = NULL,
                                 .max_files = 5,
                                 .format_if_mount_failed = false };
  esp_err_t ret = esp_vfs_spiffs_register(&conf);

  if(ret != ESP_OK) {
    if(ret == ESP_FAIL) {
      ESP_LOGE(TAG, "Failed to mount or format filesystem");
    }
    else if(ret == ESP_ERR_NOT_FOUND) {
      ESP_LOGE(TAG, "Failed to find SPIFFS partition");
    }
    else {
      ESP_LOGE(TAG, "Failed to initialize SPIFFS (%s)", esp_err_to_name(ret));
    }
    return ESP_FAIL;
  }

  size_t total = 0, used = 0;
  ret = esp_spiffs_info(NULL, &total, &used);
  if(ret != ESP_OK) {
    ESP_LOGE(TAG,
             "Failed to get SPIFFS partition information (%s)",
             esp_err_to_name(ret));
  }
  else {
    ESP_LOGI(TAG,
             "Filesystem init finished! Partition size: total: %d bytes, "
             "used: %d bytes (%i%%)",
             total,
             used,
             (used * 100) / total);
  }
  return ret;
}

#endif

static void
init_wifi_apmode(int wifi_mode)
{
  ESP_ERROR_CHECK(esp_netif_init());
  ESP_ERROR_CHECK(esp_event_loop_create_default());
  esp_default_netif = esp_netif_create_default_wifi_ap();
  wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
  ESP_ERROR_CHECK(esp_wifi_init(&cfg));
  ESP_ERROR_CHECK(esp_event_handler_instance_register(
    WIFI_EVENT, ESP_EVENT_ANY_ID, &wifi_event_handler, NULL, NULL));

  esp_event_handler_instance_t ap_staipassigned_ip;
  ESP_ERROR_CHECK(
    esp_event_handler_instance_register(IP_EVENT,
                                        IP_EVENT_AP_STAIPASSIGNED,
                                        &wifi_event_handler,
                                        NULL,
                                        &ap_staipassigned_ip));

  wifi_config_t wifi_config = {
    .ap = { .ssid = "DroneBridge ESP32 Init Error",
            .password = "dronebridge",
            .ssid_len = 0,
            .authmode = WIFI_AUTH_WPA2_PSK,
            .channel = db_param_channel.value.db_param_u8.value,
            .ssid_hidden = 0,
            .beacon_interval = 100,
            .max_connection = 10 },
  };
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wstringop-truncation"
  // Set Wi-Fi SSID and password from the stored parameters
  if(strlen(DB_PARAM_WIFI_SSID) >= db_param_ssid.value.db_param_str.min_len) {
    strncpy((char *)wifi_config.ap.ssid,
            DB_PARAM_WIFI_SSID,
            db_param_ssid.value.db_param_str.max_len);
  }
  else {
    // something is wrong - switch to default value
    strncpy((char *)wifi_config.ap.ssid,
            (char *)db_param_ssid.value.db_param_str.default_value,
            db_param_ssid.value.db_param_str.max_len);
  }
  if(strlen(DB_PARAM_PASS) >= db_param_pass.value.db_param_str.min_len) {
    strncpy((char *)wifi_config.ap.password,
            DB_PARAM_PASS,
            db_param_pass.value.db_param_str.max_len);
  }
  else {
    // something is wrong - switch to default value
    strncpy((char *)wifi_config.ap.password,
            (char *)db_param_pass.value.db_param_str.default_value,
            db_param_pass.value.db_param_str.max_len);
  }
#pragma GCC diagnostic pop

  ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_AP));
  if(wifi_mode == DB_WIFI_MODE_AP_LR) {
    ESP_LOGI(TAG,
             "Enabling LR Mode on access point. This device will be invisible "
             "to non-ESP32 devices!");
    ESP_ERROR_CHECK(
      esp_wifi_set_protocol(WIFI_IF_AP, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_LR));
  }
  else {
    ESP_ERROR_CHECK(esp_wifi_set_protocol(WIFI_IF_AP, WIFI_PROTOCOL_11B));
  }
  ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_AP, &wifi_config));
  wifi_country_t wifi_country = {
    .cc = "US", .schan = 1, .nchan = 13, .policy = WIFI_COUNTRY_POLICY_MANUAL
  };
  ESP_ERROR_CHECK(esp_wifi_set_country(&wifi_country));
  ESP_ERROR_CHECK(esp_wifi_set_ps(WIFI_PS_NONE));
  ESP_ERROR_CHECK(esp_wifi_start());
  DB_RADIO_IS_OFF = false; // just to be sure, but should not be necessary

  /* Assign IP to ap/gateway */
  esp_netif_ip_info_t ip;
  memset(&ip, 0, sizeof(esp_netif_ip_info_t));
  ip.ip.addr = ipaddr_addr(DB_PARAM_AP_IP);
  ip.netmask.addr = ipaddr_addr("255.255.255.0");
  ip.gw.addr = ipaddr_addr(DB_PARAM_AP_IP);
  ESP_ERROR_CHECK(esp_netif_dhcps_stop(esp_default_netif));
  ESP_ERROR_CHECK(esp_netif_set_ip_info(esp_default_netif, &ip));
  ESP_ERROR_CHECK(esp_netif_dhcps_start(esp_default_netif));

  ESP_ERROR_CHECK(esp_netif_set_hostname(
    esp_default_netif,
    (char *)db_param_wifi_hostname.value.db_param_str.value));
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wstringop-truncation"
  strncpy(CURRENT_CLIENT_IP, DB_PARAM_AP_IP, sizeof(CURRENT_CLIENT_IP));
#pragma GCC diagnostic pop
  ESP_ERROR_CHECK(esp_read_mac(LOCAL_MAC_ADDRESS, ESP_MAC_WIFI_SOFTAP));
}

static int
init_wifi_clientmode()
{
  s_wifi_event_group = xEventGroupCreate();
  ESP_ERROR_CHECK(esp_netif_init());
  ESP_ERROR_CHECK(esp_event_loop_create_default());
  esp_default_netif = esp_netif_create_default_wifi_sta();
  assert(esp_default_netif);
  ESP_ERROR_CHECK(esp_netif_set_hostname(
    esp_default_netif,
    (char *)db_param_wifi_hostname.value.db_param_str.value));

  wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
  ESP_ERROR_CHECK(esp_wifi_init(&cfg));
  esp_event_handler_instance_t instance_any_id;
  esp_event_handler_instance_t instance_got_ip;
  ESP_ERROR_CHECK(esp_event_handler_instance_register(WIFI_EVENT,
                                                      ESP_EVENT_ANY_ID,
                                                      &wifi_event_handler,
                                                      NULL,
                                                      &instance_any_id));
  ESP_ERROR_CHECK(esp_event_handler_instance_register(IP_EVENT,
                                                      IP_EVENT_STA_GOT_IP,
                                                      &wifi_event_handler,
                                                      NULL,
                                                      &instance_got_ip));

  wifi_config_t wifi_config = {
    .sta = { .ssid = "DroneBridge_ESP32_Init",
             .password = "dronebridge",
             .threshold.authmode = WIFI_AUTH_WEP },
  };
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wstringop-truncation"
  // Set Wi-Fi SSID and password from the stored parameters
  if(strlen(DB_PARAM_WIFI_SSID) >= db_param_ssid.value.db_param_str.min_len) {
    strncpy((char *)wifi_config.ap.ssid,
            DB_PARAM_WIFI_SSID,
            db_param_ssid.value.db_param_str.max_len);
  }
  else {
    // something is wrong - switch to default value
    strncpy((char *)wifi_config.ap.ssid,
            (char *)db_param_ssid.value.db_param_str.default_value,
            db_param_ssid.value.db_param_str.max_len);
  }
  if(strlen(DB_PARAM_PASS) >= db_param_pass.value.db_param_str.min_len) {
    strncpy((char *)wifi_config.ap.password,
            DB_PARAM_PASS,
            db_param_pass.value.db_param_str.max_len);
  }
  else {
    // something is wrong - switch to default value
    strncpy((char *)wifi_config.ap.password,
            (char *)db_param_pass.value.db_param_str.default_value,
            db_param_pass.value.db_param_str.max_len);
  }
#pragma GCC diagnostic pop

  ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
  if(DB_PARAM_WIFI_EN_GN) {
    // only makes sense if the AP can not do proper N or you do not need range
    // or want Wi-Fi 6 ax support
#ifdef CONFIG_IDF_TARGET_ESP32C6
    ESP_ERROR_CHECK(esp_wifi_set_protocol(
      WIFI_IF_STA,
      WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G | WIFI_PROTOCOL_11N |
        WIFI_PROTOCOL_11AX | WIFI_PROTOCOL_LR));
#else
    ESP_ERROR_CHECK(
      esp_wifi_set_protocol(WIFI_IF_STA,
                            WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G |
                              WIFI_PROTOCOL_11N | WIFI_PROTOCOL_LR));
#endif
  }
  else {
    ESP_ERROR_CHECK(esp_wifi_set_protocol(
      WIFI_IF_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_LR)); // range for sure
  }
  ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_STA, &wifi_config));
  ESP_ERROR_CHECK(esp_wifi_set_ps(WIFI_PS_NONE)); // disable power saving
  ESP_ERROR_CHECK(esp_wifi_start());
  DB_RADIO_IS_OFF = false; // just to be sure, but should not be necessary
  // consider connection lost after 1s of no beacon - triggers reconnect via
  // WIFI_EVENT_STA_DISCONNECTED event
  ESP_ERROR_CHECK(esp_wifi_set_inactive_time(WIFI_IF_STA, 3));

