DroneBridge/ESP32/main/main.c
  ESP_LOGI(TAG,
           "Init of WiFi Client-Mode finished. (SSID: %s PASS: %s)",
           DB_PARAM_WIFI_SSID,
           DB_PARAM_PASS);

  /* Waiting until either the connection is established (WIFI_CONNECTED_BIT) or
   * connection failed for the maximum number of re-tries (WIFI_FAIL_BIT). The
   * bits are set by event_handler() (see above) */
  EventBits_t bits = xEventGroupWaitBits(s_wifi_event_group,
                                         WIFI_CONNECTED_BIT | WIFI_FAIL_BIT,
                                         pdFALSE,
                                         pdFALSE,
                                         portMAX_DELAY);

  /* xEventGroupWaitBits() returns the bits before the call returned, hence we
   * can test which event actually happened. */
  bool enable_temp_ap_mode = false;
  if(bits & WIFI_CONNECTED_BIT) {
    ESP_LOGI(TAG,
             "Connected to ap SSID:%s password:%s",
             DB_PARAM_WIFI_SSID,
             DB_PARAM_PASS);
  }
  else if(bits & WIFI_FAIL_BIT) {
    ESP_LOGW(TAG,
             "Failed to connect to SSID:%s, password:%s",
             DB_PARAM_WIFI_SSID,
             DB_PARAM_PASS);
    enable_temp_ap_mode = true;
  }
  else {
    ESP_LOGE(TAG, "UNEXPECTED WIFI EVENT");
  }
  if(enable_temp_ap_mode) {
    ESP_LOGW(TAG,
             "WiFi client mode was not able to connect to the specified "
             "access point");
    return -1;
  }

  ESP_LOGI(TAG, "WiFi client mode enabled and connected!");
  ESP_ERROR_CHECK(esp_read_mac(LOCAL_MAC_ADDRESS, ESP_MAC_WIFI_STA));
  return 0;
}

static void
init_wifi_espnow()
{
  ESP_LOGI(TAG, "Setting up Wi-Fi for ESP-NOW");
  ESP_ERROR_CHECK(esp_netif_init());
  ESP_ERROR_CHECK(esp_event_loop_create_default());
  wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
  ESP_ERROR_CHECK(esp_wifi_init(&cfg));
  ESP_ERROR_CHECK(esp_wifi_set_storage(WIFI_STORAGE_RAM));
  ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
  ESP_ERROR_CHECK(esp_wifi_set_ps(WIFI_PS_NONE));
  ESP_ERROR_CHECK(esp_wifi_start());
  ESP_ERROR_CHECK(
    esp_wifi_set_channel(DB_PARAM_CHANNEL, WIFI_SECOND_CHAN_NONE));
  ESP_ERROR_CHECK(
    esp_wifi_set_protocol(WIFI_IF_STA, WIFI_PROTOCOL_11B | WIFI_PROTOCOL_LR));
  ESP_LOGI(TAG,
           "Enabled ESP-NOW WiFi Mode! LR Mode is set. This device will be "
           "invisible to non-ESP32 devices!");
  ESP_ERROR_CHECK(esp_read_mac(LOCAL_MAC_ADDRESS, ESP_MAC_WIFI_STA));
}

static void
read_settings_nvs()
{
  nvs_handle my_handle;
  if(nvs_open(NVS_NAMESPACE, NVS_READONLY, &my_handle) != ESP_OK) {
    ESP_LOGI(
      TAG, "NVS namespace not found. Using default values, setting up NVS...");
    nvs_close(my_handle);
    ESP_ERROR_CHECK(nvs_flash_erase());
    ESP_ERROR_CHECK(nvs_flash_init());

    // Set all parameters to their default values when flash is empty
    db_param_reset_all();

    // Now save these defaults to NVS
    db_write_settings_to_nvs();

    // Print parameters to console for logging
    uint8_t param_str_buffer[512] = { 0 };
    db_param_print_values_to_buffer(param_str_buffer);
    ESP_LOGI(
      TAG, "Initialized with default values:\n%s", (char *)param_str_buffer);
  }
  else {
    ESP_LOGI(TAG, "Reading settings from NVS");
    db_param_read_all_params_nvs(&my_handle);
    nvs_close(my_handle);

    // print parameters to console for logging
    uint8_t param_str_buffer[512] = { 0 };
    db_param_print_values_to_buffer(param_str_buffer);
    ESP_LOGI(TAG, "\n%s", (char *)param_str_buffer);

    // Check if we have a saved UDP client from the last session. Add it to the
    // known udp clients if there is one.
    if(strlen((char *)db_param_udp_client_ip.value.db_param_str.value) > 0 &&
       db_param_udp_client_port.value.db_param_u16.value != 0) {
      // there was a saved UDP client in the NVM from last session - add it to
      // the udp clients list
      ESP_LOGI(TAG,
               "Adding %s:%i to known UDP clients.",
               (char *)db_param_udp_client_ip.value.db_param_str.value,
               db_param_udp_client_port.value.db_param_u8.value);
      struct sockaddr_in new_sockaddr;
      memset(&new_sockaddr, 0, sizeof(new_sockaddr));
      new_sockaddr.sin_family = AF_INET;
      inet_pton(AF_INET,
                (char *)db_param_udp_client_ip.value.db_param_str.value,
                &new_sockaddr.sin_addr);
      new_sockaddr.sin_port =
        htons(db_param_udp_client_port.value.db_param_u16.value);
      struct db_udp_client_t new_udp_client = {
        .udp_client = new_sockaddr, .mac = { 0, 0, 0, 0, 0, 0 } // dummy MAC
      };
      bool save_to_nvm = false; // no need to save it to NVM again
      db_add_to_known_udp_clients(udp_conn_list, new_udp_client, save_to_nvm);
    }
    else {
      // no saved UDP client - do nothing
      ESP_LOGI(TAG, "No saved UDP client - skipping");
    }
  }
}

static void
short_press_callback(void *arg, void *usr_data)
{
  ESP_LOGW(TAG,
           "Short press detected setting wifi mode to access point with "
           "password: dronebridge");
  DB_RADIO_MODE_DESIGNATED =
    DB_WIFI_MODE_AP; // do not directly change DB_PARAM_RADIO_MODE since it is
                     // not safe and constantly processed by other tasks. Save
                     // settings and reboot will assign
                     // DB_RADIO_MODE_DESIGNATED to DB_PARAM_RADIO_MODE.
  db_param_set_to_default(&db_param_ssid);
  db_param_set_to_default(&db_param_pass);
  db_write_settings_to_nvs();
  esp_restart();
}

static void
long_press_callback(void *arg, void *usr_data)
{
  ESP_LOGW(TAG,
           "Reset triggered via GPIO %i. Resetting settings and rebooting",
           DB_RESET_PIN);
  DB_RADIO_MODE_DESIGNATED =
    DB_WIFI_MODE_AP; // do not directly change DB_PARAM_RADIO_MODE since it is
                     // not safe and constantly processed by other tasks. Save
                     // settings and reboot will assign
                     // DB_RADIO_MODE_DESIGNATED to DB_PARAM_RADIO_MODE.
  db_param_reset_all();
  db_write_settings_to_nvs();
  esp_restart();
}

static void
set_reset_trigger()
{
  button_config_t gpio_btn_cfg = {
            .type = BUTTON_TYPE_GPIO,
            .long_press_time = CONFIG_BUTTON_LONG_PRESS_TIME_MS,
            .short_press_time = CONFIG_BUTTON_SHORT_PRESS_TIME_MS,
            .gpio_button_config = {
                    .gpio_num = DB_RESET_PIN,
                    .active_level = 0,
            },
    };
  button_handle_t gpio_btn = iot_button_create(&gpio_btn_cfg);
  if(NULL == gpio_btn) {
    ESP_LOGE(TAG, "Creating reset button failed");
  }
  else {
    iot_button_register_cb(
      gpio_btn, BUTTON_SINGLE_CLICK, short_press_callback, NULL);
    iot_button_register_cb(
      gpio_btn, BUTTON_LONG_PRESS_UP, long_press_callback, NULL);
  }
}

static void
configure_antenna()
{
#if defined(CONFIG_DB_HAS_RF_SWITCH) && defined(CONFIG_DB_RF_SWITCH_GPIO) &&  \
  (CONFIG_DB_RF_SWITCH_GPIO != 0)
#ifdef CONFIG_DB_OFFICIAL_BOARD_1_X_C6
  gpio_set_direction(GPIO_NUM_3, GPIO_MODE_OUTPUT);
  gpio_set_level(GPIO_NUM_3, 0); // set to low to enable RF switching
#endif
  gpio_set_direction(CONFIG_DB_RF_SWITCH_GPIO, GPIO_MODE_OUTPUT);
  gpio_set_level(
    CONFIG_DB_RF_SWITCH_GPIO,
    DB_PARAM_EN_EXT_ANT); // set level to enable external/internal antenna
  ESP_LOGI(TAG, "External antenna usage: %i", DB_PARAM_EN_EXT_ANT);
#endif
}

/**
 * Main entry point.
 */
void
app_main()
{
  db_param_init_parameters();
  udp_conn_list = db_udp_client_list_create(); // http server functions and
                                               // read_settings_nvs expect
                                               // the list to exist
  esp_err_t ret = nvs_flash_init();
  if(ret == ESP_ERR_NVS_NO_FREE_PAGES) {
    ESP_ERROR_CHECK(nvs_flash_erase());
    ret = nvs_flash_init();
  }
  ESP_ERROR_CHECK(ret);
  read_settings_nvs();
  DB_RADIO_MODE_DESIGNATED =
    DB_PARAM_RADIO_MODE; // must always match, mismatch only allowed when
                         // changed by user action and not rebooted, yet.
  set_reset_trigger();
  configure_antenna();

  switch(DB_PARAM_RADIO_MODE) {
  case DB_WIFI_MODE_AP:
  case DB_WIFI_MODE_AP_LR:
    init_wifi_apmode(DB_PARAM_RADIO_MODE);
    break;
  case DB_WIFI_MODE_ESPNOW_AIR:
  case DB_WIFI_MODE_ESPNOW_GND:
    init_wifi_espnow();
    db_start_espnow_module();
    break;
  case DB_BLUETOOTH_MODE:
#ifdef CONFIG_BT_ENABLED
    init_wifi_apmode(
      DB_WIFI_MODE_AP); // WiFi & BLE co-existence to enable webinterface
    db_ble_queue_init();
    db_ble_init();
#else
    DB_RADIO_MODE_DESIGNATED = DB_WIFI_MODE_AP;
    DB_PARAM_RADIO_MODE = DB_WIFI_MODE_AP;
    ESP_LOGE(TAG,
             "Bluetooth is not enabled with this build. Please enable it in "
             "menuconfig and re-compile. Switching to AP mode.");
    init_wifi_apmode(DB_WIFI_MODE_AP);
#endif
    break;
  default:
    // Wi-Fi client mode with LR mode enabled
    if(init_wifi_clientmode() < 0) {
      ESP_LOGE(TAG, "Failed to init Wifi Client Mode");
    }
    break;
  }

  if(DB_PARAM_RADIO_MODE != DB_WIFI_MODE_ESPNOW_AIR &&
     DB_PARAM_RADIO_MODE != DB_WIFI_MODE_ESPNOW_GND &&
     DB_PARAM_RADIO_MODE != DB_WIFI_MODE_AP_LR) {
    // no need to start these services - won`t be available anyway - safe the
    // resources
    start_mdns_service();
    netbiosns_init();
    netbiosns_set_name("dronebridge");
  }
  ESP_ERROR_CHECK(init_fs());
  db_start_control_module();

  if(DB_PARAM_RADIO_MODE != DB_WIFI_MODE_ESPNOW_AIR &&
     DB_PARAM_RADIO_MODE != DB_WIFI_MODE_ESPNOW_GND &&
     DB_PARAM_RADIO_MODE != DB_WIFI_MODE_AP_LR) {
    // no need to start these services - won`t be available anyway - safe the
    // resources
    ESP_ERROR_CHECK(start_rest_server(CONFIG_WEB_MOUNT_POINT));
    ESP_LOGI(TAG, "Rest Server started");
    // Disable legacy support for DroneBridge communication module - no use
    // case for DroneBridge for ESP32 communication_module();
  }
  ESP_LOGI(TAG, "app_main finished initial setup");
}

