DroneBridge/ESP32/main/main.c
/******************************************************************************
 * Public Function Definitions
 ******************************************************************************/

void
db_jtag_serial_info_print()
{
  uint8_t buffer[512];
  const int len = db_param_print_values_to_buffer(buffer);
  db_write_to_serial(buffer, len);
}

void
db_write_settings_to_nvs()
{
  // print parameters to console for logging
  ESP_LOGI(TAG, "Trying to save parameters:");
  uint8_t param_str_buffer[512];
  db_param_print_values_to_buffer(param_str_buffer);
  ESP_LOGI(TAG, "%s", param_str_buffer);
  ESP_LOGI(TAG, "Saving to NVS %s", NVS_NAMESPACE);
  nvs_handle_t my_handle;
  ESP_ERROR_CHECK(nvs_open(NVS_NAMESPACE, NVS_READWRITE, &my_handle));
  db_param_write_all_params_nvs(&my_handle);
  ESP_ERROR_CHECK(nvs_commit(my_handle));
  nvs_close(my_handle);
  ESP_LOGI(TAG, "Finished saving operation.");
}

void db_save_udp_client_to_nvm(struct db_udp_client_t *new_db_udp_client,
                          bool clear_client)
{
  char ip[INET_ADDRSTRLEN];
  uint16_t port;
  if(!clear_client) {
    // convert addr to string
    char client_str[INET_ADDRSTRLEN + 6];
    inet_ntop(
      AF_INET, &(new_db_udp_client->udp_client.sin_addr), ip, INET_ADDRSTRLEN);
    port = ntohs(new_db_udp_client->udp_client.sin_port);
    snprintf(client_str, sizeof(client_str), "%s:%d", ip, port);
    ESP_LOGI(TAG, "Saving UDP client %s to NVS %s", client_str, NVS_NAMESPACE);
  }
  else {
    // clear client from NVM by setting string to empty "" and port to 0
    ip[0] = '\0';
    port = 0;
    ESP_LOGI(TAG, "Clearing UDP client from NVM");
  }

  nvs_handle my_handle;
  ESP_ERROR_CHECK(nvs_open(NVS_NAMESPACE, NVS_READWRITE, &my_handle));
  ESP_ERROR_CHECK(
    nvs_set_str(my_handle, (char *)db_param_udp_client_ip.db_name, ip));
  ESP_ERROR_CHECK(
    nvs_set_u16(my_handle, (char *)db_param_udp_client_port.db_name, port));

  ESP_ERROR_CHECK(nvs_commit(my_handle));
  nvs_close(my_handle);
}

void
db_set_radio_status(uint8_t enable_wifi)
{
  if(DB_PARAM_DIS_RADIO_ON_ARM) { // check if the user enables that feature
    if(enable_wifi && DB_RADIO_IS_OFF) {
      ESP_LOGI(TAG, "Rebooting ESP32 to re-enable Wi-Fi/BLE");
      esp_restart(); // enable Wi-Fi/BLE by restarting ESP32 - an easy way to
                     // make sure all things are set up right
    }
    else if(!enable_wifi && !DB_RADIO_IS_OFF) {
      ESP_LOGI(TAG, "Disabling Wi-Fi/BLE");
      if(DB_PARAM_RADIO_MODE == DB_BLUETOOTH_MODE) {
        db_ble_deinit(); // disable BLE
        DB_RADIO_IS_OFF = true;
      }
      else {
        if(esp_wifi_stop() == ESP_OK) { // disable WiFi
          DB_RADIO_IS_OFF = true;
        }
        else {
          ESP_LOGW(TAG, "db_set_radio_status tried to disable Wi-Fi. FAILED");
        }
      }
    }
  }
  else {
    // nothing to do
  }
}